{
    "items": [
              {
              "title": "Church. Is it more than a building?",
              "author": "Courtney Chow",
              "entry_date": "09-08-2016",
              "subText": "",
              "body": "According to the Internet, 'church' is defined as a building used for public Christian worship — a building that might well resemble the one I grew up calling church. I remember it being evident to me as a child that every time I walked into that building, I was participating in something larger than I could fully understand. It triggered an acknowledgment of grandeur, displayed in the stained glass and velvet roping. It was humbling. I anticipated the smell of the sanctuary, an openness mixed with floral perfumes.\n\nBeing 'that kid' who refused to attend children’s church, I also came to associate church with the adults I saw on the stage every week. I found comfort in their voices. From a young age, I yearned to be part of the conversations they were having one day, and for some time, the church remained just that — an idea I hoped to obtain one day.\n\nAbout a year and a half ago, a pastor asked me if I would be willing to help his family build a church. Sporting my Birkenstocks, I was clearly not the top candidate for pouring concrete, so I assumed he was alluding to a different kind of 'building.' The family members simply asked that I come to their house once a week, eat a meal, and be with the others who would join. Intrigued by the chosen word 'church,' I entered a stranger's home the following Tuesday. From that day, my understanding of the word radically changed.\n\nChurch now smells like tacos and seasonal candles. It sounds like laughing children and barking dogs. It looks like a crowded floor covered in mismatched throw blankets. More profoundly, however, the word 'church' invokes something deeper than a sensory response; it has become relational. This is because the church I attend Tuesday nights could not be described without the people who substantiate it. Church encompasses the relationships that have grown in that house over months of intentional vulnerability. To describe it without including our shared experiences would be missing the point.\n\nThis has not been a quick process, nor painless. Somehow my church gained the interest of an overwhelming majority of skeptical introverts (myself included), making the goal of vulnerability and deep relationship an interesting endeavor.\n\nThe first night, four strangers showed up, and to no one’s surprise, small talk filled the time spent eating our first meal together. Four months later, a conversation about a theoretical goat farmer in Argentina, no less, launched the first truly testing discussion we’d had. Carrying themes of socialism versus capitalism, it’s what every young adult claims to hate talking about but always seems to have an opinion on. The conversation didn’t end at political ideology but eventually bled into theology and then brought about competing ideas on the character of Jesus. The familiar circle we gathered in took on the nature of something foreign and intimidating that had not yet presented itself through safe conversations.\n\nFast-forward a year, and this church is still working to fully submit to the idea of vulnerability. We have recently acknowledged a shared goal of understanding the relational reality found in the Trinity and therefore the nature of ourselves, and in this we are surrendering to a countercultural concept.\nBecause of this, we no longer fear conversations that lead to disagreement and even tension. Over time, a safe place has been created for us to discuss those very things, all the while knowing we will come back the next week stronger and more unified because through one another, we are peering further into the depth and variety of the Kingdom. Rejecting exclusive individualism, we now disclose our struggles, including addiction, self-mutilation and broken understandings of intimacy. We are offering time, the most valuable resource, to one another. We actively listen, rather than simply talk. We celebrate both the monotony and the excitement of progressing through life together.\n\nMy church, our church, started in a home. It now extends to larger places of worship, different workplaces and college towns around the nation. We are the church, everywhere. We live in this reality because the church realized as a spiritual family has no borders or limitations.\nIn revisiting my initial idea of the term, I can see the beauty of what I’m starting to understand. I can enter the same sanctuary I did as a child and be blessed to hear the same voices, but what I experience inside those walls is no longer reliant upon sensory consumption. I see the interception of the Spirit in the conversations that start between strangers, and I feel the grace of the Creator when a familiar face reminds me that the body of Christ was broken for me, His blood shed for me.\nIt’s not a complete understanding, but it’s progress that will continue with each day spent living intentionally. What I know now stands at this: I once entered a stranger's home in the hopes of starting a church, and since then, the yearning I once had to be part of something larger than myself has rested in the ease of existing in the faithful presence of other people.",
              "bioDisclaimer": "",
              "blog-primary": "girlByWater.jpg"
              },
              {
              "title": "Kingdom Conversations #1: Deconstructing Power Structures",
              "author": "Jeremy Penn",
              "entry_date": "09-07-2016",
              "subText": "Now Jesus learned that the Pharisees had heard that he was gaining and baptizing more disciples than John — although in fact it was not Jesus who baptized, but his disciples. So he left Judea and went back once more to Galilee. Now he had to go through Samaria. So he came to a town in Samaria called Sychar, near the plot of ground Jacob had given to his son Joseph. Jacob’s well was there, and Jesus, tired as he was from the journey, sat down by the well. It was about noon. When a Samaritan woman came to draw water, Jesus said to her, 'Will you give me a drink?' (His disciples had gone into the town to buy food.) The Samaritan woman said to him, 'You are a Jew and I am a Samaritan woman. How can you ask me for a drink?' (For Jews do not associate with Samaritans.)— John 4:1-9 (NIV)",
              "body": "I was born in the ’80s, and that means I grew up with cassette players in my parents’ cars and VCRs under the television set. I remember the first CD player I saw and listened to at my friend Matt’s house. It was possibly the greatest thing I had ever experienced. The next I knew, cars started having CD players in them as well.\n\nMy dad decided he wanted a CD player in his truck, so he bought a decent one from an electronics store. The next step was installing it into the old truck. At that moment, he did something crazy. My dad asked me to install the CD player for him.\n\nI remember when he turned to me and said: 'You’re better with electronics and things like this than I am. Let me know when you’re done.\n\nSo I went out to the old truck, pulled out the cassette player, cleaned up the wires and installed a new car stereo by myself. The whole time I went through this process, I was thinking, My dad, the one with power and authority, needs me. He could have done this on his own. He would have figured this out eventually, but he chose me to meet his need.\n\nWhat my dad did, intentionally or not, was begin to deconstruct my ideas of power structures. He deconstructed the way I understood power and submission, father and son interactions. In doing this, he redefined our relationship.\n\nWe see something similar in the interaction of Jesus and the woman at the well. Jesus approaches a Samaritan woman and submits to her His need. He needs a drink of water from a well to which she has access. The all-powerful One reveals His need and allows another, a woman He shouldn’t be talking to in the first place, to meet the need.\n\nIn this moment, Jesus begins the process of deconstructing the ideologies and power structures of His day. Jesus enters into the life of this woman, the one without power, and empowers her to meet the needs of the one true King.\n\nHow different is this from our culture’s obsession with power? In our culture, power and self-reliance are seen as the ultimate markers of success. In the Kingdom that Jesus is Lord of, power is to be put aside for the service and lifting up of others.\n\nAs we continue to develop communities of faith that follow Jesus together, there will be opportunities to exercise power and influence over others. Instead of relishing in these moments, may we be like Jesus and deconstruct such power structures. May we submit to one another and empower the powerless to be fully human in their journey with Jesus the King.",
              "bioDisclaimer": "",
              "blog-primary": "feet.jpg"
              },
              {
              "title": "Help Louisiana",
              "author": "Olivia B.",
              "entry_date": "09-05-2016",
              "subText": "",
              "body": "In the past few days, flooding of unprecedented effect has struck at least 20 parishes throughout Louisiana. Over the weekend, Louisiana Gov. John Bel Edwards declared a state of emergency and described the flooding as 'historic.' Over 40,000 homes are flooded, displacing at least 10,000 people to shelters with unknown numbers still stranded. Thus far, there have been 13 reported deaths. \n\nThe loss is devastating, especially for those who never expected this kind of flooding. Only an estimated 13% of affected families have flood insurance, leaving the majority with little financial assistance. The Federal Emergency Management Agency offers a maximum of $33 thousand to households not covered by flood insurance. However, State Lieutenant Governor Billy Nungesser estimates that the average amount families will actually receive is closer $7,500.\n\n'It’s not going to be an easy road for people without flood insurance,' says the Lieutenant Governor. 'We’re going to have to make that up with volunteers and private donations.'\n\nNorthland will be serving in French Settlement, a 2.3 square mile village of 1,200 people. They are the center for several other small villages and have been serving about 4,000 people since the floods. French Settlement has not seen a flood 'since before humans walked on this land,' according to Chief of Police Lawrence Callender. During the flooding, a 9-foot wall of water raced through the community and damaged 80% of all the homes.\n\nSpecific needs for filling serve teams include:\n\n. Chefs or folks with kitchen certifications\n\n. Manual labor to muck out homes and tear down sheet rock \n\n. Emotional and spiritual care folks who can also serve in the distribution center\n\n. Longwood-based admin help with logistics and paperwork",
              "bioDisclaimer": "",
              "blog-primary": "boatOverHead.jpg"
              },
              {
              "title": "Mixed Messages",
              "author": "Becky Hunter",
              "entry_date": "09-05-2016",
              "subText": "",
              "body": "We pulled up to the intersection. And there it was, a green stop sign. My brain almost exploded; I was more confused than a chameleon in a bag of skittles. Everyone knows green means go. But when a green octagon has the word STOP on it, I guess one should stop?\n\nGenerally speaking, mixed messages are quite common. What parent hasn’t yelled to a screaming child, 'STOP YELLING!'  And who of us has never witnessed a young woman giving a hopeful glance toward a young man and then pretending to be put off by his follow-up 'Hello!'  And what about those people, we all know, who shake their heads 'no,' all the while they are explaining some great opportunity we’d be foolish to miss? That’s a communication dichotomy that’s just downright freaky! Mixed messages communicate conflicting information, sometimes verbally, other times non-verbally. Either way, mixed messages confuse us.\n\nThere may be no way to avoid getting mixed messages, but surely those of us who love Jesus should avoid giving them. Matthew 5:33, 37 puts it like this in The Message Bible, 'Don't say anything you don't mean...When you manipulate words to get your own way, you go wrong.'\n\n'God is not a God of confusion…' - 1 Corinthians 14:33a (NASB)",
              "bioDisclaimer": "",
              "blog-primary": "chalkboard.jpg"
              },
              {
              "title": "Kaká and UWS Partner With Northland to Help Clendenin",
              "author": "Ember Langley",
              "entry_date": "08-31-2016",
              "subText": "",
              "body": "The recent flooding in the small coal-mining town of Clendenin, West Virginia, proved to be nothing short of heartbreaking. In this community of 1,200 people, the flood damaged more than 85 percent of businesses and homes, including gas stations and grocery stores.\n\nAlmost immediately after the flooding occurred, Northland’s Disaster Response team arrived. With over $2,000 worth of food, Northland’s mobile kitchen provided meals for the community and helpful hands willing to serve in immediate response.\n\nIn the midst of the tragedy, people noticed what could have seemed like an insignificant detail. The soccer uniforms and gear for Herbert Hoover High School and Elkview Middle School were destroyed in this third-deadliest flood in the state. Soccer is a favorite pastime in the community, with many people looking forward to games and the training season.\n\nInternational soccer superstar Ricardo Kaká of Major League Soccer’s Orlando City Soccer Club heard about Clendenin and what Northland’s Disaster Response team had been doing, and contacted D.J. Bernatavitz and Tom Traxler of United World Soccer, as well as James Sang Lee of North Sports and Games.\n\n'I heard about Clendenin, the situation of those kids, and I [was] touched to help those kids. And I called some friends to help them as well,' Kaká said.\n\nTraxler said that as he was sitting at his desk one day at work, a text came through from Kaká mentioning his idea to send new soccer gear to the kids affected, and immediately Traxler knew United World Soccer had to be involved in this process. \n\n'United World Soccer is always looking for charitable ways we can help different kinds of organizations all over the globe through soccer. We mainly work with Souls for Soles and Farova Development Initiative in regards to donating soccer equipment, but this unique opportunity come to us directly through Ricardo,' E-Commerce Manager at United World Soccer DJ Bernatavitz said.\n\nWith pieces moving from four organizations, personalized jerseys, brand-new cleats and all new gear was delivered last week for boys and girls teams at each school, with more gear to be delivered by the end of the week.\n\nWith the new soccer season, those in the Clendenin community are continuing to come together and grow beyond the disaster that ravaged their town.\n\n'We already have people saying that when we get this done, when we get this rebuilt, it’s going to be better than ever. I haven’t heard anyone say, ‘I’ve gotta get out of here,’ said soccer Coach Jared Reins.",
              "bioDisclaimer": "",
              "blog-primary": "laserLightsOnRoof.jpg"
              },
              {
              "title": "Around the Globe With Northland",
              "author": "Global Missions Department",
              "entry_date": "08-30-2016",
              "subText": "Northland is involved on a large scale with mission work around the world. Recently, we talked with Sean Cooper, Northland’s Global Missions pastor, about Northland's global missions strategy and how you can participate in building the Kingdom worldwide!",
              "body": "Northland: People are usually surprised when they learn more about Northland’s Global Missions involvement. Why?\n\nSean: Northland’s involvement around the world is extensive, more so than most congregants (and staff!) realize. We are partnered through relationship in such countries as Uganda, Haiti, Ukraine, Sri Lanka, Brazil, South Africa, Swaziland, Japan, India — the list goes on, and includes places that we can’t name. People might be surprised at how much good is happening in these countries and around the world. Naturally, the media covers what’s sensational, which is usually a lot of negative press, but the amount of good happening through churches and through our partners is overwhelming.\n\nThe variety of relationships is astounding. Northland is partnered with churches and Christians in Middle Eastern countries, and we hear stories of those who stay in dangerous places to serve their homes. One of our oldest partnerships is with Kithu Sevana, a church in Sri Lanka that takes the lead on some incredible church-planting efforts, as well as anti-human trafficking and ethnic reconciliation movements.\n\nNorthland: What is Northland’s global missions strategy?\n\nSean: We highly value relationship and networking, or building connection between churches and organizations that we are in partnership with. While investing deeply in our existing relationships, we always seek to identify places and new relationships and partnerships. For example, we’re connecting with church leaders in northwest Brazil, where there is a high number of unreached people groups. The small role we can play is bringing to the table a variety of organizations we are in relationship with that can bring the best of what they do. For instance, a Bible translation organization is helping with translation, a separate organization is helping deliver creative evangelism tools, while another is introducing leadership and discipleship training to help sustain the growth of new churches. It’s exciting when a variety of organizations can all play a small part in an effort like this!\n\nNorthland: Northland is partnered with churches in Uganda and Haiti, two countries with history of heavy influence from Western churches. What does Northland’s involvement look like in these countries?\n\nSean: In both these places, our hope is that both we and the Christians we are in relationship with can learn from each other and grow in our abilities to reach our communities. The leaders we’re working with want to set up strategic training outposts throughout their regions that will focus on Scriptural learning, discipleship and leadership development, and community outreach. Rather than sending money to fund specific community development or relief projects, we’re aiming to resource these training outposts and the individuals that are trained so they can impact their own communities. Pastor Brutus from Haiti has shared with us how he was touched as he read the workbooks of his 100+ students at their training center. As he read about how these young students are frustrated with the current state of the church in Haiti, he was in tears because they did not stop with their frustrations. Rather, they were brainstorming ideas of how the church could be strengthened and grow. How amazing it is that young people realize that they need to have a vision for the church in their country!\n\nThe same thing is happening in Uganda. You saw a video highlight about Pastor Robert’s team of pastors who are helping contribute to the growth of the church in their country.\n\nNorthland: It sounds like developing national leaders in these countries is of high importance to Northland’s global missions strategy. Can you expand on that?\n\nSean: We are always looking for the next generation of leadership, both here in Orlando and at our partner churches. This year, we’ve been blown away by the way that God brought key young leaders to help with the work that both Northland and our partners are doing. One compelling example of an extraordinary young leader is Anton from New Life Church in Ukraine. He is a young man with a passion for the church in his country. He has lived through the last two revolutions and he is currently serving on the war-front, which has given him a sense of urgency to reach his country. He uses his own resources to fill an old van with enough gas to travel to churches throughout Ukraine, especially in the east, and help support their pastors in whatever way he can. Sometime in the near future, we are looking to financially support Anton and 4 new “missionaries” like him that are indigenous young leaders in their churches and communities.\n\nWhat’s really fun is that these young leaders have really strong friendships with young leaders here at Longwood, bridging between our partnerships in efforts to keep expanding the church. In fact, one of these young leaders – another young man from Ukraine – is joining some younger Northland staff on an upcoming trip to Honduras.\n\nNorthland: Speaking of short term trips, Northland’s biggest global missions emphasis for many years was on short term trips. Is that still the case?\n\nSean: This year we’ve started to discover ways to do different types of short-term trips. We’re starting to send different types of teams to visit our partners, primarily with the intent of learning. What we’ve realized is that our partners have expertise around topics of evangelism, outreach and disciple-making, and we want to learn from them. While we still value service-related trips, we hope to instill the idea in trip participants that we have just as much to learn from our partners as they have to learn from us. The team we are sending to Honduras this September is a pilot trip where participants will learn from one of our partners, Great Commission Latin America.\n\nNorthland: How do you stay in contact with partner churches and relationships worldwide?\n\nSean: We’ve been astounded at the use of technology to keep relationships strong. We’ve sent a video teleconferencing system to Egypt, Ukraine, Uganda and India. Often when I’m driving home after work I’m shaking my head, blown away at how many meetings we had that day using this system with leaders from three or four different countries. Even though I was in my office, it was almost like we went to four different places! Technology doesn’t replace being physically with people, but we realized that once we established a friendship, the technological approach doesn’t get in the way, but rather it bridges more interaction.\n\nNorthland: How can congregants be more involved, plugged in, tuned in?\n\nSean: We don’t have to come up with something catchy and new to offer. The things that have rung true for centuries are what will make a difference. Congregation, please pray. We’re developing new ways to get information to the congregation so that they can stay updated on developments and prayer requests. Look for these in the Respond paper!\n\nAs always, there are short-term trips. It’s an exciting time to get involved in this way!\n\nLastly, it would be foolish not to encourage people to keep giving financially. Right now we are in the process of establishing next year’s budget, which impacts a lot of efforts around the world. I want our congregation members to know just how meaningful their financial contributions are, not just to Northland at Longwood, but to the church around the world.\n\nWhat is so important for Northlanders to remember is that this church is connected all over the world. Evangelism, disciple-making, training of church leaders and church planting are massive efforts taking place every day. Northlanders’ prayers, financial giving and even their involvement in serving here locally — all of those things link us to God’s work around the globe.",
              "bioDisclaimer": "",
              "blog-primary": "globe.jpg"
              },
              {
              "title": "Journey",
              "author": "Becky Hunter",
              "entry_date": "08-29-2016",
              "subText": "",
              "body": "There is a fishing pier at Florida’s Ft. Clinch State Park that is a half-mile long. Recently, Joel and I walked all the way to the end of it. As we stared over the end of the pier I asked him, “Can you imagine how deep the water is this far out?” He said, “Well, seeing as how this pier runs parallel to the shoreline, probably not as deep as we’d guess.”  Sure enough, 50 yards to the right of the pier was a rocky shoreline that followed the length of the pier. But, because I had focused on walking so far on something so solid, it felt to me like I had arrived at the deep but, truth be told, walking parallel to the shore was never going to get me to the deep.\n\nI was 12 when I began thinking seriously about God and walking in faith. I went a long way on my faith journey focusing on each step and trusting the supportive structures that made moving on simple and fairly easy. My assumption was that I would eventually end up at a point of deep faith if I just kept walking. Somewhere along the line, though, I realized that rather than really relying on God, I was relying almost entirely on the structures that were supporting my “long obedience in the same direction.” I was way too focused on how far I’d come to notice that the strong religious framework had been put in place long ago so that I could reach the place where I desired nothing more than a deep walk with God. Eugene Peterson caught one aspect of this kind of faith-journey progress when he wrote,  “Worship does not satisfy our hunger for God – it whets our appetite.”\n\nWe can make progress with each step of faith, but let’s never be satisfied until we move out into the deep with God. Kingdom blessings for all are greater when we decide to move into the deep.\n\n“After speaking for a while, Jesus speaks to Simon. Jesus: Move out into deeper water, and drop your nets to see what you’ll catch.” - Luke 5:4 (The Voice)",
              "bioDisclaimer": "",
              "blog-primary": "girlByOceanRocks.jpg"
              },
              {
              "title": "Lunch Sack Letters",
              "author": "Jeremey Penn",
              "entry_date": "08-18-2016",
              "subText": "",
              "body": "I sat down in my school cafeteria and opened up my brown paper sack to see what my mom had prepared for lunch. With great excitement, I saw a sheet of yellow legal paper inside the bag. I pulled out the paper, knowing that I was about to read a great story my dad had written. The lunch inside no longer mattered. The only thing I was concerned about was the tale scribbled on the paper.\n\nI quickly unfolded the sheet of paper and began to read about my dad’s fishing adventures in Michigan as a kid and how he hated all the bell-bottom pants his young friends were wearing during the ’60s. The stories contained no lesson or hidden moral agenda. They were just stories — my dad telling me about himself.\n\nHis stories wrapped up the way all the other lunch sack letters ended. They always ended with the story to top all stories. He ended each lunch sack letter by telling me about the time his teacher asked him, “What do you want to be when you grow up?” Most boys in the class had answered with such jobs as fireman, policeman or baseball player. But my dad’s answer was different: “I want to be a daddy when I grow up.”\n\nAt the end of his grand story, he would always write, “Jeremy, you and your brother and sister made my dream come true.”\n\nI received lunch sack letters from time to time during my childhood, and they continued to show up in my sack lunch throughout high school. The days the letters appeared were always my favorite. I got to learn about my dad, and they reminded me I was loved and I had value. The college professor, the pastor, the Ph.D. had stooped to my level — the level of a little boy who could barely tie his own shoes — and told me I was the best part of his story.\n\nStories have a unique way of communicating and connecting with people. Stories tie us together, reveal our culture and context, and bring cohesiveness to a seemingly pointless and disconnected stream of events. Stories reveal purpose and provide insight into how God has woven together the tapestry of our lives.\n\nTherefore, it is not surprising that God has revealed Himself through story. Scripture uniquely reveals God’s story, through the lens of creation, the Fall, Israel, Jesus and the church. God unveils His story and reveals Himself as a God on mission for the redemption of the whole world. In Deuteronomy 6, we read that God expects His people to retell the story of God so the world, specifically His children, will know the triune God and be faithful to Him. God calls people to faithfulness not through coercion, but through revealing Himself through the story of a people — Israel — and of a person — Jesus.\n\nAs the church gathers in my house every Tuesday, we create space for people to share stories. We leave room for people to reveal themselves, one to another, so we might discern how God is continuing to tell His story in the world through His people. We often hear stories of heartache and victory, conflict and reconciliation, sin and forgiveness. As we listen to stories, we remain present with one another so we might tend to the presence of Christ in one another. Jesus is revealed through the telling of stories, and lives are transformed as we recognize how the stories of our lives are enmeshed with the ongoing story of God in the world.\n\nMay we be present with one another in the act of storytelling. May we discern the presence of Christ in the stories of our lives and, in so doing, prepare ourselves for mission in the world.",
              "bioDisclaimer": "",
              "blog-primary": "caveHoleOrangeLight.jpg"
              },
              {
              "title": "Heart",
              "author": "Becky Hunter",
              "entry_date": "08-18-2016",
              "subText": "",
              "body": "For a long time I believed that a thick skin and tender heart are required for long-term effective ministry. But recently, as I was trying to encourage someone with that tidbit of wisdom, the thought crossed my mind that maybe what we need more than a tender heart is a strong heart. And as for the thick skin, surely there’s plenty of personal protection in the full armor of God that we Christians already wear. Striving to get a thicker skin, now, seems to me to be kind of ridiculous.\n\nI don’t need or want teflon-like protection to keep things from “getting to me.” As a Christian, my life is ministry. Always. Everywhere. What I really need and want is to have a heart that is strong enough to lift others’ heavy burdens up to God without losing one ounce of the joy that comes with a heart that’s been given to Him.\n\n“Be of good courage, and he shall strengthen your heart, all ye that hope in the Lord.” - Psalm 31:24 (KJV)",
              "bioDisclaimer": "",
              "blog-primary": "flowerDark.jpg"
              },
              {
              "title": "An Unexpected Call",
              "author": "Anna Kaminski",
              "entry_date": "08-18-2016",
              "subText": "",
              "body": "He had questions. Lots of them. And they were the kind that Google just wasn’t satisfying. But he wasn’t ready to give up so easily, so he typed in another question and stumbled upon a video called “Ask a Pastor.”\n\n“That’s how I found you,” he said.\n\nMonday night, and I was just about to transition to a different project at The Hub when the call came in. The evening Welcome Desk volunteer was headed in from the parking lot, so I answered the phone.\n\n“Hello? Can I speak to someone about Jesus, please?” The voice on the other end was young and nervous. “If a pastor isn’t available, then can I just talk to you about Jesus, please?”\n\nWe were moments away from the Monday evening service, and our ministers on duty, or MODs, as we call them, had retired for the day. “I’m happy to talk to you about Jesus,” I replied. “What would you like to know?”\n\n“Well, I’m 13, and I live in Chicago,” he began. “I’ve been struggling with some things in my life, and I want to know if I can be forgiven even if I keep struggling with the same things. I pray for forgiveness, but sometimes I still struggle. Does this make me a bad person?”\n\nHe proceeded to tell me that he had asked his mom his faith questions and she had given him answers, but he wanted a second opinion on them from a church. Then he shared that he didn’t attend a church and wanted to find one near him. After he viewed Northland’s “Ask a Pastor” video online, he decided we could help him find a church to attend.\n\n“You see, I just started to read the Bible,” he continued. “But it’s hard to make sense of it sometimes, you know?”\n\nI knew. There had been a time in my own life when I began to explore the Bible on my own, and I remembered how difficult it was to understand at first.\n\n“Have you ever read The Message version of the Bible … I’m sorry, what was your name again?” I asked.\n\n“No ma’am, I haven’t,” he said. “Let me write that down real fast. And my name is Lorenzo without the Z-O. Just Loren.”\n\nI smiled as this Jesus-hungry boy began to slowly sound out “M-E-S-S-A-G-E” as he wrote down my suggestion.\n\n“Holy Spirit, guide me with this boy,” I silently prayed in my heart as Loren continued to write down some Scriptures I also shared. Suddenly, I felt inclined to ask him a question. “Loren, I know you are struggling with some things in your life, but do you believe that Jesus has the power to help you have victory over them?” I asked.\n\n“I do, but it seems like no matter how hard I pray, nothing happens,” he said quietly.\n\nThen I felt moved to ask a bolder question. “Have you ever asked Jesus into your heart to change your life? Like, have you ever told Him that you believe He is your personal Lord and Savior?”\n\n“No ma’am,” he said. “I don’t know how to do that. I’m still trying to understand how to be a Christian.'\n\n'Loren, would you like to ask Jesus into your heart to change your life right now?' I asked.\n\n'Yes. Yes ma’am, I would,' he said.\n\nSo at 6:15 p.m. on Monday, August 8, a 13-year-old boy from Chicago named Loren gave his life to Christ on the phone. After he repeated a prayer of salvation with me, we talked about the concept of grace.\n\n“You mean I don’t have to try so hard, that Jesus will do the work for me if I call upon Him?” he asked in astonishment.\n\n“That’s the power of grace — you can’t earn it. It’s a special gift that Jesus gives to you because He loves you so much no matter what you’ve done or didn’t do,'' I said.\n\n'Amazing,' he said, almost as in disbelief.\n\n'Yes, amazing grace,' I said.\n\nThe Welcome Desk receives all sorts of calls, but every now and then, Jesus sends an extra special one over like this, and it reminds us what an amazing God we serve.",
              "bioDisclaimer": "",
              "blog-primary": "usWithLights.jpg"
              },
              {
              "title": "How You Can Help Put a Roof Over Chronic Homelessness",
              "author": "Northland Church",
              "entry_date": "08-10-2016",
              "subText": "",
              "body": "Are you a landlord or property manager? You can be the reason why someone will have a place to sleep at night. You’re a significant resource in reducing homelessness and helping individuals reach positive and life changing goals.\n\nThe Central Florida Supportive Housing Program (CFSH) helps chronically homeless tenants in Orange, Osceola and Seminole Counties to be successful, long-term renters. Your rentals can help individuals take charge of their lives and make your community a better place to live.\n\n• Tenants will have support and assistance, including home visits, to ensure success.\n\n• Enjoy one point of contact for questions or concerns.\n\n• Portions of guaranteed rent can be provided via direct deposit, and tenants will be monitored to make sure payments are made on time.\n\n• Some may be eligible for compensation if significant property repairs are necessary.\n\n• Limited funding available for co-signing and/or Master Listing agreements.\n\nFor more information contact Rebecca Lang at 407-937-1807 or email crn@northlandchurch.net.",
              "bioDisclaimer": "",
              "blog-primary": "guyInDesert.jpg"
              },
              {
              "title": "Getting Real with Celebrate Recovery",
              "author": "Northland Church",
              "entry_date": "07-28-2016",
              "subText": "",
              "body": "Our sanctuary may be filled with real struggles, real open wounds, but we are often too afraid to acknowledge that we’re bleeding. Or worse, we don’t recognize that our struggle can be an addiction, even if it doesn’t come in a bottle.\n\nWe don’t picture codependency as a drug, or see loving relationships as a vice. But Celebrate Recovery at Northland Church realizes that addiction often goes far beyond just substance abuse and usually originates deeper in the heart.\n\n“I would say that if there was a misunderstanding about the ministry, it’s that the majority assume that we deal strictly with drugs and alcohol,” says John. “Yet, it’s appropriate for anyone with a hurt, habit or hang-up.”\n\nThis is proven by the fact that about two-thirds of the attendees come to Celebrate Recovery for something other than substance abuse.\n\nCelebrate Recovery is a recovery program meeting weekly to serve both Northland’s members and the local community. It offers a 12-step program that is based on eight principles from the Beatitudes. The group is about more than breaking addiction habits — it focuses on healing, self-reflection, writing testimony and giving back.\n\nRecovery serves a variety of hurts that can be made into addiction, including anxiety and depression, drugs and alcohol, codependency, loving relationships and anger. The program also has classes that are gender-specific groups for certain issues, including sexual addiction for men or “mothers of addicts” for women.\n\nThe group meets every Friday, 7 to 9 p.m. in The Rink, where hot dinner is served to adults for three dollars and children eat free. After the meal is served, the group moves to praise and worship, followed by a teaching or testimony. Then the attendees divide into small group, where they focus on incorporating the lessons learned from the night into their futures.\n\nCelebrate Recovery is led by about 35 leaders, not counselors. While the men and women have been thoroughly trained in the curriculum, they are not counselors, nor do they try to fix anyone. They are simply facilitators of conversation, trying to open up discussion in a non-judgmental atmosphere.\n\nSince their first meeting about seven years ago, the group has never skipped a Friday night. No matter the holiday — Christmas Eve, New Year’s — they will be in the Rink, sacrificing their time in case someone is hurting.\n\n“Part of our ministry is to recognize that we have broken families,' John says. 'Some of our folks are estranged from their families, or maybe they need boundaries and they’re not able to enjoy a holiday in particular with their families, so we do that together.'\n\nBecause many parents would not be able to attend Celebrate Recovery without provided child care, the program also invites children to participate in the healing process. Recovery offers two programs, Celebration Station for children up to 11 years old and The Landing for teens ages 12 to 17, with an emphasis on family-based healing.\n\nThe children’s program has a looser structure that allows children to process some of the hurts they may be facing at home or at school.\n\n“Sometimes this could just be about is there a safe place to share,” says John. “Where does a teen go where they can safely share, do they have anyone they can safely confide in? And that’s where this becomes pretty powerful.”\n\nAlthough Celebrate Recovery has seen about 35,000 people come through the doors since they began working in the community, breaking the stigma surrounding seeking help is still a challenge.\n\nAccording to John, some people choose not to go to Recovery because they are worried about church members seeing them attend and losing their anonymity. Others are afraid to go to an atmosphere in which they fear judgment and shame.\n\nThe Celebrate Recovery team ultimately hopes that those who have attended and benefitted from the meetings will speak up when they see others in their community at church and home who may be facing some of the same struggles they defeated. In the meantime, they believe that their job is not to fix or to convert, but to welcome and invite others to feel comfortable and let the Holy Spirit do its work.\n\n'The healing really starts when people focus less on what they have to stop doing and when they can start to find more productive things to say yes to,' John says. 'Maybe Friday night can be a yes thing.'",
              "bioDisclaimer": "",
              "blog-primary": "surfRider.jpg"
              },
              {
              "title": "True North Interns Say Goodbye with Coffeehouse Concert",
              "author": "Northland Church",
              "entry_date": "07-17-2016",
              "subText": "",
              "body": "For the past seven weeks, True North interns have been running all over Northland’s campus — we’ve seen them singing on stage, wrangling middle school kids in The Rink and chasing electrical cords through the catwalks in the sanctuary. But as July draws to a close, the 16 interns that have served in five different departments will be entering their final week of work in Orlando.\n\nAs a parting gift to the community that has welcomed them, taught them and given them a home this summer, the interns will be putting on a free coffeehouse-style concert at Nature’s Table Café on Saturday at 7 p.m., following the worship service. The event offers free coffee provided by Nature’s Table Café and the chance for the congregation to get to know the interns musically on a more personal level, not just on the big stage.\n\nThe event will feature seven of the students from worship, student ministries and communications. They will sing and play a few songs each, ranging from covers of popular songs to original pieces. Pierce Pettis will also be performing a set at the coffeehouse, in addition to his concert in the Rink on Sunday.\n\n“I’m excited because we get to come together and perform for one another and have fun. And drink free coffee — which is even better,” says worship intern Mary Padgett.\n\nThe interns are excited to provide their adopted Northland family with a little music and entertainment before packing up for the fall, and to say thanks for the experiences they’ve gained this summer.\n\n“From the moment I walked through the door I felt welcomed and loved. There was an immediate investment in my life that was taking place,” says Mary. “I hate to go and I don’t want to leave but I know that I’ve been equipped here for whatever the Lord has in my future.”\n\nSawyer Bridges, a student ministries intern who will also be playing in the concert, reflected that his time at Northland has changed the way he views unity in the church.\n\n“After going through a summer here at Northland, the Lord has really taught me what community is and what community means,” he says. “It’s really showed me togetherness in the church and what it’s supposed to look like. It’s changed my life and I have a new aspect of community that I didn’t have before.”",
              "bioDisclaimer": "",
              "blog-primary": "peopleInCoffeShop.jpg"
              }
              ],
    "pageInfo": {
        "totalResults": 2038,
        "resultsPerPage": 20
    }
}